// TASK 1
// Напишіть програму, яка отримує від користувача 2 числа.
// Вивести різницю з допомогою функції alert.
// Підказка: для отримання чисел від користувача використовуйте функцію prompt

function getDifference() {
const num1 = prompt("Введіть перше число:");
const num2 = prompt("Введіть друге число:");
let d = num1 - num2;
alert("Різниця між числами: " + d);
}

getDifference();

// TASK 2
// Напишіть програму, яка отримує від користувача 2 числа.
// Вивести максимальне з цих двох чисел.
// Підказка: для отримання чисел від користувача використовуйте функцію prompt

function getMax () {
    const num1 = prompt("Введіть перше число:");
    const num2 = prompt("Введіть друге число:");
    if (num1 > num2) {
        alert("Перше число більше: " + num1);
    } else {
        alert("Друге число більше: " + num2);
    }
}
getMax();

// TASK 3
// Завдання: вивести в консолі «Hello World» або за допомогою функції alert, якщо ви використовуєте браузер
// your code here: alert("hello world");
